{
  "title": "Hilfe und Dokumentation",
  "subtitle": "Erfahren Sie, wie Sie WSL UI verwenden",
  "gettingStarted": {
    "title": "Erste Schritte",
    "whatIsWslUi": "Was ist WSL UI?",
    "whatIsWslUiText": "WSL UI ist eine Desktop-Anwendung zur Verwaltung von Windows Subsystem for Linux (WSL)-Distributionen. Sie bietet eine grafische Oberfläche für gängige WSL-Operationen wie Starten, Stoppen, Erstellen und Konfigurieren von Linux-Distributionen.",
    "mainDashboard": "Haupt-Dashboard",
    "mainDashboardText": "Die Hauptansicht zeigt alle Ihre installierten WSL-Distributionen als Karten an. Jede Karte zeigt den Distributionsnamen, den Status (online/offline), die Festplattennutzung und Schnellaktionsschaltflächen.",
    "quickActions": "Schnellaktionen",
    "quickActionsText": "Klicken Sie auf die Menüschaltfläche (drei Punkte) auf einer Distributionskarte, um auf Schnellaktionen wie Öffnen eines Terminals, Datei-Explorers, IDE oder Verwalten der Distribution zuzugreifen."
  },
  "distroManagement": {
    "title": "Distributionsverwaltung",
    "startingStoppingTitle": "Starten und Stoppen",
    "start": "Eine Distribution starten",
    "stop": "Eine laufende Distribution stoppen",
    "setAsDefault": "Als Standard festlegen",
    "setAsDefaultText": "Legen Sie eine Distribution als Standard fest, um sie beim Ausführen von WSL-Befehlen ohne Angabe eines Distributionsnamens zu verwenden.",
    "resourceMonitoring": "Ressourcenüberwachung",
    "resourceMonitoringText": "Laufende Distributionen zeigen die CPU- und Speicherauslastung in Echtzeit an. Die Festplattengröße wird für alle Distributionen angezeigt."
  },
  "advancedOps": {
    "title": "Erweiterte Operationen",
    "rename": "Umbenennen",
    "renameText": "Ändern Sie den Namen einer Distribution. Sie können auch das Windows Terminal-Profil und die Startmenü-Verknüpfung aktualisieren. Die Distribution muss angehalten sein.",
    "move": "Verschieben",
    "moveText": "Verschieben Sie eine Distribution auf ein anderes Laufwerk oder in einen anderen Ordner. Nützlich für die Verwaltung des Festplattenplatzes. WSL muss vollständig heruntergefahren sein.",
    "resizeDisk": "Festplattengröße ändern",
    "resizeDiskText": "Vergrößern Sie die virtuelle Festplatte für Distributionen, die mehr Platz benötigen. Nur Vergrößerung wird unterstützt (kein Verkleinern). WSL muss heruntergefahren sein.",
    "setWslVersion": "WSL-Version festlegen",
    "setWslVersionText": "Konvertieren Sie zwischen WSL 1 und WSL 2. WSL 2 bietet bessere Leistung mit einem vollständigen Linux-Kernel. Die Konvertierung kann mehrere Minuten dauern.",
    "sparseMode": "Sparse-Modus",
    "sparseModeText": "Aktivieren Sie die automatische Festplattenplatzrückgewinnung. Die virtuelle Festplatte schrumpft, wenn Sie Dateien innerhalb der Distribution löschen.",
    "compactDisk": "Festplatte komprimieren",
    "compactDiskText": "Ein-Klick-Optimierung zur Rückgewinnung ungenutzten Speicherplatzes von der virtuellen Festplatte einer Distribution. Führt automatisch fstrim aus, fährt WSL herunter und komprimiert die VHDX-Datei. Erfordert Administratorrechte und dauert 1-2 Minuten."
  },
  "creatingDistros": {
    "title": "Distributionen erstellen",
    "quickInstall": "Schnellinstallation (Microsoft Store)",
    "quickInstallText": "Ein-Klick-Installation offizieller Distributionen wie Ubuntu, Debian und openSUSE.",
    "containerImages": "Container-Images",
    "containerImagesText": "Erstellen Sie Distributionen aus Docker- oder Podman-Container-Images. Unterstützt Docker Hub und andere Registrys.",
    "directDownload": "Direkter Download",
    "directDownloadText": "Laden Sie rootfs-Archive von konfigurierbaren URLs herunter. Beinhaltet Alpine, NixOS, Void Linux und mehr.",
    "communityCatalog": "Community-Katalog (LXC)",
    "communityCatalogText": "Durchsuchen Sie Hunderte von Distributionen vom Linux Containers-Imageserver."
  },
  "backupRestore": {
    "title": "Sicherung und Wiederherstellung",
    "export": "Exportieren",
    "exportText": "Speichern Sie eine Distribution in einer .tar-Archivdatei zur Sicherung oder Migration. Sie können sie später oder auf einem anderen Computer wiederherstellen.",
    "import": "Importieren",
    "importText": "Stellen Sie eine Distribution aus einer .tar-Archivdatei wieder her. Wählen Sie einen Namen und Installationsort für die importierte Distribution.",
    "clone": "Klonen",
    "cloneText": "Erstellen Sie eine Kopie einer vorhandenen Distribution mit einem neuen Namen. Nützlich zum Testen oder Erstellen von Varianten."
  },
  "customActions": {
    "title": "Benutzerdefinierte Aktionen",
    "whatAre": "Was sind benutzerdefinierte Aktionen?",
    "whatAreText": "Benutzerdefinierte Aktionen sind vom Benutzer definierte Shell-Befehle, die im Schnellaktionen-Menü erscheinen. Erstellen Sie Aktionen für häufige Aufgaben wie Systemupdates, Sicherungen oder Entwicklungseinrichtung.",
    "variables": "Variablen",
    "variablesText": "Verwenden Sie Variablen in Ihren Befehlen, die zur Laufzeit ersetzt werden:",
    "varDistroName": "Distributionsname",
    "varHome": "Pfad des Home-Verzeichnisses",
    "varUser": "Standardbenutzer",
    "varWindowsHome": "Windows-Benutzerverzeichnis",
    "targeting": "Ziel-Distributionen",
    "targetingText": "Aktionen können auf alle Distributionen, bestimmte Distributionen nach Name oder Distributionen abzielen, die einem Regex-Muster entsprechen."
  },
  "theming": {
    "title": "Designs und Darstellung",
    "builtinThemes": "Integrierte Designs",
    "builtinThemesText": "Wählen Sie aus 17 professionell gestalteten Designs, darunter dunkle, helle und mittlere Optionen. Beliebte Designs sind Obsidian, Dracula, Nord und Solarized.",
    "accessibilityThemes": "Barrierefreiheits-Designs",
    "accessibilityThemesText": "Zwei kontraststarke Designs sind für Benutzer mit eingeschränktem Sehvermögen verfügbar: Hoher Kontrast (dunkel) und Hoher Kontrast hell.",
    "customTheme": "Benutzerdefiniertes Design",
    "customThemeText": "Erstellen Sie Ihr eigenes Design mit voller Kontrolle über 29 Farbvariablen, darunter Hintergründe, Text, Ränder, Akzente und mehr."
  },
  "keyboardShortcuts": {
    "title": "Tastaturkürzel",
    "tab": "Tab",
    "tabAction": "Nächstes Element",
    "shiftTab": "Umschalt+Tab",
    "shiftTabAction": "Vorheriges Element",
    "enter": "Eingabe",
    "enterAction": "Aktivieren / Absenden",
    "escape": "Escape",
    "escapeAction": "Dialog oder Menü schließen",
    "space": "Leertaste",
    "spaceAction": "Kontrollkästchen umschalten",
    "accessibility": "Barrierefreiheit",
    "accessibilityText": "WSL UI unterstützt Bildschirmleseprogramme, Tastaturnavigation und berücksichtigt Systemeinstellungen für reduzierte Animationen."
  },
  "settingsOverview": {
    "title": "Einstellungsübersicht",
    "terminal": "Terminal: Windows Terminal, benutzerdefinierte Terminal-Anwendungen oder Eingabeaufforderung konfigurieren",
    "ide": "IDE: VS Code, Cursor oder benutzerdefinierte IDE-Integration einrichten",
    "wslGlobal": "WSL Global: Speicher, CPU, Swap, Netzwerkmodus und WSLg konfigurieren",
    "perDistro": "Pro Distribution: Automount-Optionen, Netzwerkeinstellungen, systemd und Startbefehle",
    "polling": "Abfrage: Auto-Aktualisierungsintervalle für Status und Ressourcen anpassen",
    "timeouts": "Zeitlimits: Operationszeitlimits für langsame Systeme konfigurieren",
    "executables": "Programmpfade: Standardpfade für WSL, PowerShell und andere Tools überschreiben"
  },
  "integrations": {
    "title": "Integrationen",
    "terminal": "Terminal-Integration",
    "terminalText": "Öffnen Sie Distributionen in Windows Terminal, der Eingabeaufforderung oder einer beliebigen benutzerdefinierten Terminal-Anwendung. Konfigurieren Sie Ihr bevorzugtes Terminal in den Einstellungen.",
    "ide": "IDE-Integration",
    "ideText": "Öffnen Sie Distributionen direkt in VS Code oder anderen IDEs. Der Stammordner der Distribution wird in Ihrem Editor geöffnet.",
    "fileExplorer": "Datei-Explorer",
    "fileExplorerText": "Durchsuchen Sie Distributionsdateien im Windows Explorer über den Netzwerkpfad \\\\wsl$.",
    "systemTray": "Infobereich",
    "systemTrayText": "Minimieren Sie in den Infobereich für schnellen Zugriff. Konfigurieren Sie das Schließverhalten in den Einstellungen."
  },
  "troubleshooting": {
    "title": "Fehlerbehebung",
    "wslNotDetected": "WSL nicht erkannt",
    "wslNotDetectedText": "Stellen Sie sicher, dass WSL installiert und aktiviert ist. Führen Sie wsl --status in PowerShell aus, um dies zu überprüfen. Möglicherweise müssen Sie die Windows-Funktionen für WSL aktivieren.",
    "operationsTimeout": "Operationen laufen ab",
    "operationsTimeoutText": "Wenn Operationen häufig ablaufen, erhöhen Sie die Zeitlimitwerte unter Einstellungen > Zeitlimits. Die App verwendet exponentielles Backoff, um die Belastung bei Problemen zu reduzieren.",
    "distroWontStart": "Distribution startet nicht",
    "distroWontStartText": "Versuchen Sie, WSL mit wsl --shutdown neu zu starten, und starten Sie dann die Distribution erneut.",
    "fullGuide": "Vollständiger Leitfaden zur Fehlerbehebung"
  },
  "resources": {
    "title": "Ressourcen und Support",
    "wslUiWebsite": "WSL UI-Webseite",
    "githubRepo": "GitHub-Repository",
    "reportIssue": "Problem melden",
    "octasoftWebsite": "Octasoft Ltd-Webseite",
    "microsoftDocs": "Microsoft WSL-Dokumentation"
  }
}
