{
  "title": "Ayuda y documentación",
  "subtitle": "Aprenda a usar WSL UI",
  "gettingStarted": {
    "title": "Primeros pasos",
    "whatIsWslUi": "¿Qué es WSL UI?",
    "whatIsWslUiText": "WSL UI es una aplicación de escritorio para administrar distribuciones de Windows Subsystem for Linux (WSL). Proporciona una interfaz gráfica para operaciones comunes de WSL como iniciar, detener, crear y configurar distribuciones Linux.",
    "mainDashboard": "Panel principal",
    "mainDashboardText": "La vista principal muestra todas sus distribuciones WSL instaladas como tarjetas. Cada tarjeta muestra el nombre de la distribución, el estado (en línea/sin conexión), el uso del disco y botones de acción rápida.",
    "quickActions": "Acciones rápidas",
    "quickActionsText": "Haga clic en el botón de menú (tres puntos) en cualquier tarjeta de distribución para acceder a acciones rápidas como abrir una terminal, explorador de archivos, IDE o administrar la distribución."
  },
  "distroManagement": {
    "title": "Administración de distribuciones",
    "startingStoppingTitle": "Iniciar y detener",
    "start": "Iniciar una distribución",
    "stop": "Detener una distribución en ejecución",
    "setAsDefault": "Establecer como predeterminada",
    "setAsDefaultText": "Establezca una distribución como predeterminada para usarla al ejecutar comandos WSL sin especificar un nombre de distribución.",
    "resourceMonitoring": "Monitoreo de recursos",
    "resourceMonitoringText": "Las distribuciones en ejecución muestran el uso de CPU y memoria en tiempo real. El tamaño del disco se muestra para todas las distribuciones."
  },
  "advancedOps": {
    "title": "Operaciones avanzadas",
    "rename": "Renombrar",
    "renameText": "Cambie el nombre de una distribución. También puede actualizar el perfil de Windows Terminal y el acceso directo del menú Inicio. Requiere que la distribución esté detenida.",
    "move": "Mover",
    "moveText": "Reubique una distribución a una unidad o carpeta diferente. Útil para administrar el espacio en disco. Requiere que WSL esté completamente apagado.",
    "resizeDisk": "Redimensionar disco",
    "resizeDiskText": "Expanda el tamaño del disco virtual para distribuciones que necesitan más espacio. Solo se admite la expansión (no la reducción). Requiere apagar WSL.",
    "setWslVersion": "Establecer versión de WSL",
    "setWslVersionText": "Convierta entre WSL 1 y WSL 2. WSL 2 ofrece mejor rendimiento con un kernel Linux completo. La conversión puede tardar varios minutos.",
    "sparseMode": "Modo disperso",
    "sparseModeText": "Habilite la recuperación automática de espacio en disco. El disco virtual se reducirá a medida que elimine archivos dentro de la distribución.",
    "compactDisk": "Compactar disco",
    "compactDiskText": "Optimización con un clic para recuperar espacio no utilizado del disco virtual de una distribución. Ejecuta automáticamente fstrim, apaga WSL y compacta el archivo VHDX. Requiere privilegios de administrador y toma 1-2 minutos."
  },
  "creatingDistros": {
    "title": "Crear distribuciones",
    "quickInstall": "Instalación rápida (Microsoft Store)",
    "quickInstallText": "Instalación con un clic de distribuciones oficiales como Ubuntu, Debian y openSUSE.",
    "containerImages": "Imágenes de contenedores",
    "containerImagesText": "Cree distribuciones a partir de imágenes de contenedores Docker o Podman. Admite Docker Hub y otros registros.",
    "directDownload": "Descarga directa",
    "directDownloadText": "Descargue archivos rootfs desde URLs configurables. Incluye Alpine, NixOS, Void Linux y más.",
    "communityCatalog": "Catálogo de la comunidad (LXC)",
    "communityCatalogText": "Explore cientos de distribuciones del servidor de imágenes de Linux Containers."
  },
  "backupRestore": {
    "title": "Copia de seguridad y restauración",
    "export": "Exportar",
    "exportText": "Guarde una distribución en un archivo .tar para copia de seguridad o migración. Puede restaurarla más tarde o en otra máquina.",
    "import": "Importar",
    "importText": "Restaure una distribución desde un archivo .tar. Elija un nombre y ubicación de instalación para la distribución importada.",
    "clone": "Clonar",
    "cloneText": "Cree una copia de una distribución existente con un nuevo nombre. Útil para pruebas o crear variantes."
  },
  "customActions": {
    "title": "Acciones personalizadas",
    "whatAre": "¿Qué son las acciones personalizadas?",
    "whatAreText": "Las acciones personalizadas son comandos de shell definidos por el usuario que aparecen en el menú de acciones rápidas. Cree acciones para tareas comunes como actualizaciones del sistema, copias de seguridad o configuración de desarrollo.",
    "variables": "Variables",
    "variablesText": "Use variables en sus comandos que se reemplazan en tiempo de ejecución:",
    "varDistroName": "Nombre de la distribución",
    "varHome": "Ruta del directorio de inicio",
    "varUser": "Usuario predeterminado",
    "varWindowsHome": "Directorio del usuario de Windows",
    "targeting": "Distribuciones objetivo",
    "targetingText": "Las acciones pueden dirigirse a todas las distribuciones, distribuciones específicas por nombre o distribuciones que coincidan con un patrón regex."
  },
  "theming": {
    "title": "Temas y apariencia",
    "builtinThemes": "Temas integrados",
    "builtinThemesText": "Elija entre 17 temas diseñados profesionalmente, incluyendo opciones oscuras, claras y de término medio. Los temas populares incluyen Obsidian, Dracula, Nord y Solarized.",
    "accessibilityThemes": "Temas de accesibilidad",
    "accessibilityThemesText": "Dos temas de alto contraste están disponibles para usuarios con baja visión: Alto contraste (oscuro) y Alto contraste claro.",
    "customTheme": "Tema personalizado",
    "customThemeText": "Cree su propio tema con control total sobre 29 variables de color, incluyendo fondos, texto, bordes, acentos y más."
  },
  "keyboardShortcuts": {
    "title": "Atajos de teclado",
    "tab": "Tab",
    "tabAction": "Siguiente elemento",
    "shiftTab": "Shift+Tab",
    "shiftTabAction": "Elemento anterior",
    "enter": "Enter",
    "enterAction": "Activar / Enviar",
    "escape": "Escape",
    "escapeAction": "Cerrar diálogo o menú",
    "space": "Espacio",
    "spaceAction": "Alternar casilla de verificación",
    "accessibility": "Accesibilidad",
    "accessibilityText": "WSL UI es compatible con lectores de pantalla, navegación por teclado y respeta las preferencias del sistema para movimiento reducido."
  },
  "settingsOverview": {
    "title": "Resumen de configuración",
    "terminal": "Terminal: Configurar Windows Terminal, aplicaciones de terminal personalizadas o símbolo del sistema",
    "ide": "IDE: Configurar VS Code, Cursor o integración con IDE personalizado",
    "wslGlobal": "WSL Global: Configurar memoria, CPU, swap, modo de red y WSLg",
    "perDistro": "Por distribución: Opciones de montaje automático, configuración de red, systemd y comandos de arranque",
    "polling": "Consulta: Ajustar intervalos de actualización automática para estado y recursos",
    "timeouts": "Tiempos de espera: Configurar tiempos de espera de operaciones para sistemas lentos",
    "executables": "Rutas de ejecutables: Anular rutas predeterminadas para WSL, PowerShell y otras herramientas"
  },
  "integrations": {
    "title": "Integraciones",
    "terminal": "Integración con terminal",
    "terminalText": "Abra distribuciones en Windows Terminal, Símbolo del sistema o cualquier aplicación de terminal personalizada. Configure su terminal preferido en Configuración.",
    "ide": "Integración con IDE",
    "ideText": "Abra distribuciones directamente en VS Code u otros IDEs. La carpeta raíz de la distribución se abre en su editor.",
    "fileExplorer": "Explorador de archivos",
    "fileExplorerText": "Explore los archivos de la distribución en el Explorador de Windows usando la ruta de red \\\\wsl$.",
    "systemTray": "Bandeja del sistema",
    "systemTrayText": "Minimice a la bandeja del sistema para acceso rápido. Configure el comportamiento de cierre en Configuración."
  },
  "troubleshooting": {
    "title": "Solución de problemas",
    "wslNotDetected": "WSL no detectado",
    "wslNotDetectedText": "Asegúrese de que WSL esté instalado y habilitado. Ejecute wsl --status en PowerShell para verificar. Es posible que necesite habilitar las características de Windows para WSL.",
    "operationsTimeout": "Las operaciones agotan el tiempo de espera",
    "operationsTimeoutText": "Si las operaciones agotan el tiempo de espera con frecuencia, aumente los valores de tiempo de espera en Configuración > Tiempos de espera. La aplicación usa retroceso exponencial para reducir la carga durante los problemas.",
    "distroWontStart": "La distribución no inicia",
    "distroWontStartText": "Intente reiniciar WSL con wsl --shutdown y luego inicie la distribución de nuevo.",
    "fullGuide": "Guía completa de solución de problemas"
  },
  "resources": {
    "title": "Recursos y soporte",
    "wslUiWebsite": "Sitio web de WSL UI",
    "githubRepo": "Repositorio de GitHub",
    "reportIssue": "Reportar un problema",
    "octasoftWebsite": "Sitio web de Octasoft Ltd",
    "microsoftDocs": "Documentación de WSL de Microsoft"
  }
}
