{
  "title": "सहायता और दस्तावेज़ीकरण",
  "subtitle": "WSL UI का उपयोग करना सीखें",
  "gettingStarted": {
    "title": "शुरुआत करें",
    "whatIsWslUi": "WSL UI क्या है?",
    "whatIsWslUiText": "WSL UI Windows Subsystem for Linux (WSL) डिस्ट्रिब्यूशन को प्रबंधित करने के लिए एक डेस्कटॉप एप्लिकेशन है। यह Linux डिस्ट्रिब्यूशन को शुरू करने, रोकने, बनाने और कॉन्फ़िगर करने जैसे सामान्य WSL संचालन के लिए एक ग्राफ़िकल इंटरफ़ेस प्रदान करता है।",
    "mainDashboard": "मुख्य डैशबोर्ड",
    "mainDashboardText": "मुख्य दृश्य आपके सभी इंस्टॉल किए गए WSL डिस्ट्रिब्यूशन को कार्ड के रूप में दिखाता है। प्रत्येक कार्ड डिस्ट्रिब्यूशन का नाम, स्थिति (ऑनलाइन/ऑफ़लाइन), डिस्क उपयोग और त्वरित कार्य बटन प्रदर्शित करता है।",
    "quickActions": "त्वरित कार्य",
    "quickActionsText": "टर्मिनल खोलने, फ़ाइल एक्सप्लोरर, IDE, या डिस्ट्रिब्यूशन प्रबंधन जैसे त्वरित कार्यों तक पहुंचने के लिए किसी भी डिस्ट्रिब्यूशन कार्ड पर मेनू बटन (तीन बिंदु) पर क्लिक करें।"
  },
  "distroManagement": {
    "title": "डिस्ट्रिब्यूशन प्रबंधन",
    "startingStoppingTitle": "शुरू करना और रोकना",
    "start": "डिस्ट्रिब्यूशन शुरू करें",
    "stop": "चल रहे डिस्ट्रिब्यूशन को रोकें",
    "setAsDefault": "डिफ़ॉल्ट बनाएं",
    "setAsDefaultText": "डिस्ट्रिब्यूशन नाम निर्दिष्ट किए बिना WSL कमांड चलाते समय उपयोग करने के लिए एक डिस्ट्रिब्यूशन को डिफ़ॉल्ट बनाएं।",
    "resourceMonitoring": "संसाधन निगरानी",
    "resourceMonitoringText": "चल रहे डिस्ट्रिब्यूशन वास्तविक समय CPU और मेमोरी उपयोग दिखाते हैं। सभी डिस्ट्रिब्यूशन के लिए डिस्क आकार प्रदर्शित होता है।"
  },
  "advancedOps": {
    "title": "उन्नत संचालन",
    "rename": "नाम बदलें",
    "renameText": "डिस्ट्रिब्यूशन का नाम बदलें। आप Windows Terminal प्रोफ़ाइल और स्टार्ट मेनू शॉर्टकट भी अपडेट कर सकते हैं। डिस्ट्रिब्यूशन को रोकना आवश्यक है।",
    "move": "स्थानांतरित करें",
    "moveText": "डिस्ट्रिब्यूशन को किसी अन्य ड्राइव या फ़ोल्डर में स्थानांतरित करें। डिस्क स्पेस प्रबंधन के लिए उपयोगी। WSL को पूरी तरह से बंद करना आवश्यक है।",
    "resizeDisk": "डिस्क आकार बदलें",
    "resizeDiskText": "अधिक स्थान की आवश्यकता वाले डिस्ट्रिब्यूशन के लिए वर्चुअल डिस्क आकार बढ़ाएं। केवल विस्तार समर्थित है (सिकोड़ना नहीं)। WSL शटडाउन आवश्यक है।",
    "setWslVersion": "WSL संस्करण सेट करें",
    "setWslVersionText": "WSL 1 और WSL 2 के बीच कनवर्ट करें। WSL 2 पूर्ण Linux कर्नेल के साथ बेहतर प्रदर्शन प्रदान करता है। कनवर्शन में कई मिनट लग सकते हैं।",
    "sparseMode": "स्पार्स मोड",
    "sparseModeText": "स्वचालित डिस्क स्पेस पुनर्प्राप्ति सक्षम करें। जैसे ही आप डिस्ट्रिब्यूशन के अंदर फ़ाइलें हटाते हैं, वर्चुअल डिस्क सिकुड़ जाएगी।",
    "compactDisk": "डिस्क कंपैक्ट करें",
    "compactDiskText": "डिस्ट्रिब्यूशन की वर्चुअल डिस्क से अप्रयुक्त स्थान पुनर्प्राप्त करने के लिए एक-क्लिक अनुकूलन। स्वचालित रूप से fstrim चलाता है, WSL बंद करता है, और VHDX फ़ाइल को कंपैक्ट करता है। व्यवस्थापक विशेषाधिकार आवश्यक हैं और 1-2 मिनट लगते हैं।"
  },
  "creatingDistros": {
    "title": "डिस्ट्रिब्यूशन बनाना",
    "quickInstall": "त्वरित इंस्टॉल (Microsoft Store)",
    "quickInstallText": "Ubuntu, Debian और openSUSE जैसे आधिकारिक डिस्ट्रिब्यूशन का एक-क्लिक इंस्टॉलेशन।",
    "containerImages": "कंटेनर इमेज",
    "containerImagesText": "Docker या Podman कंटेनर इमेज से डिस्ट्रिब्यूशन बनाएं। Docker Hub और अन्य रजिस्ट्रियों का समर्थन करता है।",
    "directDownload": "सीधा डाउनलोड",
    "directDownloadText": "कॉन्फ़िगर करने योग्य URL से rootfs आर्काइव डाउनलोड करें। Alpine, NixOS, Void Linux और अन्य शामिल हैं।",
    "communityCatalog": "समुदाय कैटलॉग (LXC)",
    "communityCatalogText": "Linux Containers इमेज सर्वर से सैकड़ों डिस्ट्रिब्यूशन ब्राउज़ करें।"
  },
  "backupRestore": {
    "title": "बैकअप और पुनर्स्थापना",
    "export": "निर्यात",
    "exportText": "बैकअप या माइग्रेशन के लिए डिस्ट्रिब्यूशन को .tar आर्काइव फ़ाइल में सहेजें। आप इसे बाद में या किसी अन्य मशीन पर पुनर्स्थापित कर सकते हैं।",
    "import": "आयात",
    "importText": ".tar आर्काइव से डिस्ट्रिब्यूशन पुनर्स्थापित करें। आयातित डिस्ट्रिब्यूशन के लिए एक नाम और इंस्टॉलेशन स्थान चुनें।",
    "clone": "क्लोन",
    "cloneText": "नए नाम के साथ मौजूदा डिस्ट्रिब्यूशन की प्रति बनाएं। परीक्षण या वैरिएंट बनाने के लिए उपयोगी।"
  },
  "customActions": {
    "title": "कस्टम कार्य",
    "whatAre": "कस्टम कार्य क्या हैं?",
    "whatAreText": "कस्टम कार्य उपयोगकर्ता-परिभाषित शेल कमांड हैं जो त्वरित कार्य मेनू में दिखाई देते हैं। सिस्टम अपडेट, बैकअप, या विकास सेटअप जैसे सामान्य कार्यों के लिए कार्य बनाएं।",
    "variables": "वेरिएबल",
    "variablesText": "अपने कमांड में वेरिएबल का उपयोग करें जो रनटाइम पर बदल जाते हैं:",
    "varDistroName": "डिस्ट्रिब्यूशन नाम",
    "varHome": "होम डायरेक्टरी पथ",
    "varUser": "डिफ़ॉल्ट उपयोगकर्ता",
    "varWindowsHome": "Windows उपयोगकर्ता डायरेक्टरी",
    "targeting": "डिस्ट्रिब्यूशन लक्ष्यीकरण",
    "targetingText": "कार्य सभी डिस्ट्रिब्यूशन, नाम से विशिष्ट डिस्ट्रिब्यूशन, या regex पैटर्न से मिलान करने वाले डिस्ट्रिब्यूशन को लक्षित कर सकते हैं।"
  },
  "theming": {
    "title": "थीम और रूप",
    "builtinThemes": "बिल्ट-इन थीम",
    "builtinThemesText": "डार्क, लाइट और मध्यम विकल्पों सहित 17 पेशेवर रूप से डिज़ाइन की गई थीम में से चुनें। लोकप्रिय थीम में Obsidian, Dracula, Nord और Solarized शामिल हैं।",
    "accessibilityThemes": "एक्सेसिबिलिटी थीम",
    "accessibilityThemesText": "कम दृष्टि वाले उपयोगकर्ताओं के लिए दो उच्च कंट्रास्ट थीम उपलब्ध हैं: उच्च कंट्रास्ट (डार्क) और उच्च कंट्रास्ट लाइट।",
    "customTheme": "कस्टम थीम",
    "customThemeText": "बैकग्राउंड, टेक्स्ट, बॉर्डर, एक्सेंट और अन्य सहित 29 रंग वेरिएबल पर पूर्ण नियंत्रण के साथ अपनी स्वयं की थीम बनाएं।"
  },
  "keyboardShortcuts": {
    "title": "कीबोर्ड शॉर्टकट",
    "tab": "Tab",
    "tabAction": "अगला तत्व",
    "shiftTab": "Shift+Tab",
    "shiftTabAction": "पिछला तत्व",
    "enter": "Enter",
    "enterAction": "सक्रिय करें / सबमिट करें",
    "escape": "Escape",
    "escapeAction": "डायलॉग या मेनू बंद करें",
    "space": "Space",
    "spaceAction": "चेकबॉक्स टॉगल करें",
    "accessibility": "एक्सेसिबिलिटी",
    "accessibilityText": "WSL UI स्क्रीन रीडर, कीबोर्ड नेविगेशन का समर्थन करता है, और कम मोशन के लिए सिस्टम प्राथमिकताओं का सम्मान करता है।"
  },
  "settingsOverview": {
    "title": "सेटिंग्स अवलोकन",
    "terminal": "टर्मिनल: Windows Terminal, कस्टम टर्मिनल ऐप्स, या कमांड प्रॉम्प्ट कॉन्फ़िगर करें",
    "ide": "IDE: VS Code, Cursor, या कस्टम IDE इंटीग्रेशन सेट करें",
    "wslGlobal": "WSL ग्लोबल: मेमोरी, CPU, स्वैप, नेटवर्किंग मोड और WSLg कॉन्फ़िगर करें",
    "perDistro": "प्रति-डिस्ट्रिब्यूशन: ऑटोमाउंट विकल्प, नेटवर्क सेटिंग्स, systemd और बूट कमांड",
    "polling": "पोलिंग: स्थिति और संसाधनों के लिए ऑटो-रिफ़्रेश अंतराल समायोजित करें",
    "timeouts": "टाइमआउट: धीमे सिस्टम के लिए ऑपरेशन टाइमआउट कॉन्फ़िगर करें",
    "executables": "निष्पादन योग्य पथ: WSL, PowerShell और अन्य उपकरणों के लिए डिफ़ॉल्ट पथ ओवरराइड करें"
  },
  "integrations": {
    "title": "इंटीग्रेशन",
    "terminal": "टर्मिनल इंटीग्रेशन",
    "terminalText": "Windows Terminal, कमांड प्रॉम्प्ट, या किसी भी कस्टम टर्मिनल एप्लिकेशन में डिस्ट्रिब्यूशन खोलें। सेटिंग्स में अपना पसंदीदा टर्मिनल कॉन्फ़िगर करें।",
    "ide": "IDE इंटीग्रेशन",
    "ideText": "डिस्ट्रिब्यूशन को सीधे VS Code या अन्य IDE में खोलें। डिस्ट्रिब्यूशन का रूट फ़ोल्डर आपके एडिटर में खुलता है।",
    "fileExplorer": "फ़ाइल एक्सप्लोरर",
    "fileExplorerText": "\\\\wsl$ नेटवर्क पथ का उपयोग करके Windows Explorer में डिस्ट्रिब्यूशन फ़ाइलें ब्राउज़ करें।",
    "systemTray": "सिस्टम ट्रे",
    "systemTrayText": "त्वरित पहुंच के लिए सिस्टम ट्रे में मिनिमाइज़ करें। सेटिंग्स में बंद करने का व्यवहार कॉन्फ़िगर करें।"
  },
  "troubleshooting": {
    "title": "समस्या निवारण",
    "wslNotDetected": "WSL नहीं मिला",
    "wslNotDetectedText": "सुनिश्चित करें कि WSL इंस्टॉल और सक्षम है। जांचने के लिए PowerShell में wsl --status चलाएं। आपको WSL के लिए Windows सुविधाओं को सक्षम करने की आवश्यकता हो सकती है।",
    "operationsTimeout": "ऑपरेशन टाइमआउट हो रहे हैं",
    "operationsTimeoutText": "यदि ऑपरेशन बार-बार टाइमआउट होते हैं, तो सेटिंग्स > टाइमआउट में टाइमआउट मान बढ़ाएं। ऐप समस्याओं के दौरान लोड कम करने के लिए एक्सपोनेंशियल बैकऑफ़ का उपयोग करता है।",
    "distroWontStart": "डिस्ट्रिब्यूशन शुरू नहीं होगा",
    "distroWontStartText": "wsl --shutdown के साथ WSL को पुनः आरंभ करने का प्रयास करें, फिर डिस्ट्रिब्यूशन को दोबारा शुरू करें।",
    "fullGuide": "पूर्ण समस्या निवारण गाइड"
  },
  "resources": {
    "title": "संसाधन और समर्थन",
    "wslUiWebsite": "WSL UI वेबसाइट",
    "githubRepo": "GitHub रिपॉज़िटरी",
    "reportIssue": "समस्या रिपोर्ट करें",
    "octasoftWebsite": "Octasoft Ltd वेबसाइट",
    "microsoftDocs": "Microsoft WSL दस्तावेज़ीकरण"
  }
}
