{
  "title": "Справка и документация",
  "subtitle": "Узнайте, как пользоваться WSL UI",
  "gettingStarted": {
    "title": "Начало работы",
    "whatIsWslUi": "Что такое WSL UI?",
    "whatIsWslUiText": "WSL UI — это настольное приложение для управления дистрибутивами подсистемы Windows для Linux (WSL). Оно предоставляет графический интерфейс для типовых операций WSL: запуск, остановка, создание и настройка дистрибутивов Linux.",
    "mainDashboard": "Главная панель",
    "mainDashboardText": "На главном экране все установленные дистрибутивы WSL отображаются в виде карточек. Каждая карточка содержит имя дистрибутива, статус (в сети/не в сети), использование диска и кнопки быстрых действий.",
    "quickActions": "Быстрые действия",
    "quickActionsText": "Нажмите кнопку меню (три точки) на карточке любого дистрибутива для доступа к быстрым действиям: открытие терминала, проводника, IDE или управление дистрибутивом."
  },
  "distroManagement": {
    "title": "Управление дистрибутивами",
    "startingStoppingTitle": "Запуск и остановка",
    "start": "Запустить дистрибутив",
    "stop": "Остановить работающий дистрибутив",
    "setAsDefault": "Назначить по умолчанию",
    "setAsDefaultText": "Назначьте дистрибутив по умолчанию для использования при выполнении команд WSL без указания имени дистрибутива.",
    "resourceMonitoring": "Мониторинг ресурсов",
    "resourceMonitoringText": "Для запущенных дистрибутивов отображается использование CPU и памяти в реальном времени. Размер диска отображается для всех дистрибутивов."
  },
  "advancedOps": {
    "title": "Расширенные операции",
    "rename": "Переименовать",
    "renameText": "Изменение имени дистрибутива. Также можно обновить профиль Windows Terminal и ярлык в меню «Пуск». Дистрибутив должен быть остановлен.",
    "move": "Переместить",
    "moveText": "Перемещение дистрибутива на другой диск или в другую папку. Полезно для управления дисковым пространством. Требуется полная остановка WSL.",
    "resizeDisk": "Изменить размер диска",
    "resizeDiskText": "Увеличение размера виртуального диска для дистрибутивов, которым необходимо больше места. Поддерживается только увеличение (не уменьшение). Требуется остановка WSL.",
    "setWslVersion": "Задать версию WSL",
    "setWslVersionText": "Преобразование между WSL 1 и WSL 2. WSL 2 обеспечивает лучшую производительность благодаря полноценному ядру Linux. Преобразование может занять несколько минут.",
    "sparseMode": "Разреженный режим",
    "sparseModeText": "Включить автоматическое освобождение дискового пространства. Виртуальный диск будет уменьшаться по мере удаления файлов внутри дистрибутива.",
    "compactDisk": "Сжать диск",
    "compactDiskText": "Оптимизация одним нажатием для освобождения неиспользуемого пространства виртуального диска дистрибутива. Автоматически выполняет fstrim, завершает WSL и сжимает файл VHDX. Требуются права администратора; занимает 1–2 минуты."
  },
  "creatingDistros": {
    "title": "Создание дистрибутивов",
    "quickInstall": "Быстрая установка (Microsoft Store)",
    "quickInstallText": "Установка официальных дистрибутивов, таких как Ubuntu, Debian и openSUSE, одним нажатием.",
    "containerImages": "Образы контейнеров",
    "containerImagesText": "Создание дистрибутивов из образов контейнеров Docker или Podman. Поддерживает Docker Hub и другие реестры.",
    "directDownload": "Прямая загрузка",
    "directDownloadText": "Загрузка архивов rootfs по настраиваемым URL. Включает Alpine, NixOS, Void Linux и другие.",
    "communityCatalog": "Каталог сообщества (LXC)",
    "communityCatalogText": "Просматривайте сотни дистрибутивов с сервера образов Linux Containers."
  },
  "backupRestore": {
    "title": "Резервное копирование и восстановление",
    "export": "Экспорт",
    "exportText": "Сохранение дистрибутива в архив .tar для резервного копирования или переноса. Вы можете восстановить его позже или на другом компьютере.",
    "import": "Импорт",
    "importText": "Восстановление дистрибутива из архива .tar. Выберите имя и расположение установки для импортируемого дистрибутива.",
    "clone": "Клонировать",
    "cloneText": "Создание копии существующего дистрибутива с новым именем. Полезно для тестирования или создания вариантов."
  },
  "customActions": {
    "title": "Пользовательские действия",
    "whatAre": "Что такое пользовательские действия?",
    "whatAreText": "Пользовательские действия — это определённые пользователем команды оболочки, отображаемые в меню быстрых действий. Создавайте действия для типовых задач: обновление системы, резервное копирование или настройка среды разработки.",
    "variables": "Переменные",
    "variablesText": "Используйте переменные в командах, которые подставляются при выполнении:",
    "varDistroName": "Имя дистрибутива",
    "varHome": "Путь к домашнему каталогу",
    "varUser": "Пользователь по умолчанию",
    "varWindowsHome": "Каталог пользователя Windows",
    "targeting": "Выбор целевых дистрибутивов",
    "targetingText": "Действия могут применяться ко всем дистрибутивам, к конкретным дистрибутивам по имени или к дистрибутивам, соответствующим регулярному выражению."
  },
  "theming": {
    "title": "Темы и внешний вид",
    "builtinThemes": "Встроенные темы",
    "builtinThemesText": "Выбирайте из 17 профессионально разработанных тем, включая тёмные, светлые и промежуточные варианты. Среди популярных тем: Obsidian, Dracula, Nord и Solarized.",
    "accessibilityThemes": "Темы для специальных возможностей",
    "accessibilityThemesText": "Для пользователей со слабым зрением доступны две темы с высокой контрастностью: «Высокая контрастность» (тёмная) и «Высокая контрастность» (светлая).",
    "customTheme": "Пользовательская тема",
    "customThemeText": "Создайте собственную тему с полным контролем над 29 цветовыми переменными: фон, текст, границы, акценты и другие."
  },
  "keyboardShortcuts": {
    "title": "Сочетания клавиш",
    "tab": "Tab",
    "tabAction": "Следующий элемент",
    "shiftTab": "Shift+Tab",
    "shiftTabAction": "Предыдущий элемент",
    "enter": "Enter",
    "enterAction": "Активировать / Подтвердить",
    "escape": "Escape",
    "escapeAction": "Закрыть диалог или меню",
    "space": "Пробел",
    "spaceAction": "Переключить флажок",
    "accessibility": "Специальные возможности",
    "accessibilityText": "WSL UI поддерживает программы чтения экрана, навигацию с клавиатуры и учитывает системные настройки для уменьшения анимации."
  },
  "settingsOverview": {
    "title": "Обзор настроек",
    "terminal": "Терминал: настройка Windows Terminal, пользовательских терминалов или командной строки",
    "ide": "IDE: настройка интеграции с VS Code, Cursor или другой IDE",
    "wslGlobal": "WSL — глобальные настройки: память, CPU, подкачка, сетевой режим и WSLg",
    "perDistro": "Для каждого дистрибутива: параметры автомонтирования, сетевые настройки, systemd и команды загрузки",
    "polling": "Опрос: настройка интервалов автообновления статуса и ресурсов",
    "timeouts": "Тайм-ауты: настройка тайм-аутов операций для медленных систем",
    "executables": "Пути к исполняемым файлам: переопределение стандартных путей для WSL, PowerShell и других инструментов"
  },
  "integrations": {
    "title": "Интеграции",
    "terminal": "Интеграция с терминалом",
    "terminalText": "Открывайте дистрибутивы в Windows Terminal, командной строке или любом другом терминале. Настройте предпочитаемый терминал в разделе «Настройки».",
    "ide": "Интеграция с IDE",
    "ideText": "Открывайте дистрибутивы непосредственно в VS Code или других IDE. Корневая папка дистрибутива откроется в редакторе.",
    "fileExplorer": "Проводник",
    "fileExplorerText": "Просмотр файлов дистрибутива в Проводнике Windows через сетевой путь \\\\wsl$.",
    "systemTray": "Системный трей",
    "systemTrayText": "Сворачивание в системный трей для быстрого доступа. Настройте поведение при закрытии в разделе «Настройки»."
  },
  "troubleshooting": {
    "title": "Устранение неполадок",
    "wslNotDetected": "WSL не обнаружен",
    "wslNotDetectedText": "Убедитесь, что WSL установлен и включён. Выполните wsl --status в PowerShell для проверки. Возможно, потребуется включить компоненты Windows для WSL.",
    "operationsTimeout": "Операции завершаются по тайм-ауту",
    "operationsTimeoutText": "Если операции часто завершаются по тайм-ауту, увеличьте значения в разделе Настройки > Тайм-ауты. Приложение использует экспоненциальную задержку для снижения нагрузки при сбоях.",
    "distroWontStart": "Дистрибутив не запускается",
    "distroWontStartText": "Попробуйте перезапустить WSL командой wsl --shutdown, затем запустите дистрибутив снова.",
    "fullGuide": "Полное руководство по устранению неполадок"
  },
  "resources": {
    "title": "Ресурсы и поддержка",
    "wslUiWebsite": "Сайт WSL UI",
    "githubRepo": "Репозиторий GitHub",
    "reportIssue": "Сообщить о проблеме",
    "octasoftWebsite": "Сайт Octasoft Ltd",
    "microsoftDocs": "Документация Microsoft WSL"
  }
}
